package ru.avalon.java.j20.labs.tasks;

import java.io.File;
import java.io.FileInputStream;
import java.io.FileNotFoundException;
import ru.avalon.java.j20.labs.Task;

import java.io.IOException;
import java.io.InputStream;
import java.util.Properties;

/**
 * Задание №4
 *
 * <p>
 * Тема: "Потоковый ввод-вывод. Чтение файлов конфигурации".
 */
public class Task4 implements Task {

    /**
     * {@inheritDoc}
     */
    @Override
    public void run() throws IOException {
        Properties properties = read("resources/database");

        /*
         * TODO(Студент): Выполнить задание №4
         *
         * 1. Реализовать метод read.
         *
         * 2. С использованием отладчика проверить корректность работы программы.
         */
    }

    /**
     * Выполняет чтение файла конфигураций описанного параметром {@code path}.
     *
     * @param path путь к конфигурации
     * @return новый экземпляр типа {@link Properties}
     */
    private Properties read(String path) throws FileNotFoundException, IOException {
        String sim;
        Properties proper = new Properties();
        InputStream pop = ClassLoader.getSystemResourceAsStream("resources/database.properties");
        {
            proper.load(pop);
        }
        System.out.println(proper.getProperty("db.oracle.driver.class"));
        return proper;
    }
}
